# System
octopi

# Hardware
## Logitech MX Master
solaar

# Gnome
firefox-extension-gnome-shell-integration

# Theme
catppuccin-gtk-theme-macchiato

# fonts
noto-fonts-emoji

# DEV
## tools
alacritty
bash-completion
docker
docker-compose
firefox-developer-edition
httptoolkit
insomnia
starship
tmux
postgresql
zeal-git
zsh

# kube
kubectl
kubectx
k9s
krew

### enable share screen in GMeet/firefox
xdg-desktop-portal
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk


## languages
go
python
pyenv
rust

### C# for Unity
dotnet-runtime
dotnet-sdk
dotnet-targeting-pack
mono
mono-msbuild
mono-msbuild-sdkresolver

### required for Gcloud
python39

## IDE
visual-studio-code-bin
phpstorm
pycharm-professional
vim


# Graphics
krita
shutter

# Communication
slack-desktop

# MA
google-cloud-sdk
berglas-bin
