# DEV
## tools
alacritty
bash-completion
docker
docker-compose
firefox-developer-edition
http-toolkit
insomnia
k9s
starship-bin
tmux
kubectl
kubectx
postgresql
zeal-git
zsh

### enable share screen in GMeet/firefox
xdg-desktop-portal
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk


## languages
go
python
pyenv
rust

### required for Gcloud
python39

## IDE
code
phpstorm
pycharm-professional
vim


# Graphics
krita
shutter

# Communication
slack-desktop

# MA
google-cloud-sdk
berglas-bin