# System
octopi

# Hardware
## Logitech MX Master
solaar

# Gnome
firefox-extension-gnome-shell-integration

# Theme
catppuccin-gtk-theme-macchiato

# fonts
noto-fonts-emoji

# Browsers
firefox-developer-edition
ungoogled-chromium-bin

# Network
nordvpn-bin

# DEV
## tools
alacritty
bash-completion
docker
docker-compose
# httptoolkit (electron dependency)
# bruno-bin
starship
tmux
postgresql
zeal-git
zsh

# kube
kubectl
kubectx
k9s
krew

### enable share screen in GMeet/firefox
xdg-desktop-portal
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk


## languages
go
python
pyenv
rust

# js
npm
pnpm
nvm

# infra
# terraform
tfenv

### C# for Unity
#dotnet-runtime
#dotnet-sdk
#dotnet-targeting-pack
#mono
#mono-msbuild
#mono-msbuild-sdkresolver

## IDE
visual-studio-code-bin
# phpstorm
pycharm-professional
vim


# Graphics
krita
shutter

# Communication
slack-desktop

# MA
berglas-bin

# Cloud Providers
## Gcloud
google-cloud-sdk
### required for Gcloud
python39

## AWS
aws-cli-v2-bin
aws-sam-cli-bin